************************************************************************
*     P R O J E T O  C R E S C E R   -   M A G G I                     *
*                                                                      *
************************************************************************
* Responsável ...: Michely Stefanoski                                  *
* Data desenv ...: 28.01.2008                                          *
* Tipo de prg ...: executável                                          *
* Objetivo    ...: Programa para ajustar de atribuição igual ao campo  *
*                  de referencia na tabela BSIK e BSEG                 *
************************************************************************
* Data Modif    Autor                Descriçao            Request      *
************************************************************************
* 28.01.2008   Michely               Criação                           *
*                                                                      *
************************************************************************

report zap001_atribuicao no standard page heading    "Não exibe cabeçalho standard
                         message-id z01
                         line-size 076               "Comprimento da Linha
                         line-count 65.              "Número de Linhas

*----------------------------------------------------------------------*
* Includes                                                             *
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* Tabelas Transparentes                                                *
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* Estruturas                                                           *
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* Tipos                                                                *
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* Tabelas Internas Globais                                             *
*----------------------------------------------------------------------*
data: begin of wa_bsik,
        bukrs            like bsik-bukrs,
        hkont            like bsik-hkont,
        gsber            like bsik-gsber,
        bschl            like bsik-bschl,
        belnr            like bsik-belnr,
        xblnr            like bsik-zuonr,
        zuonr            like bsik-zuonr,
      end of wa_bsik.

data: it_bsik            like standard table of wa_bsik.
*----------------------------------------------------------------------*
* Constantes                                                           *
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* Definição de Parâmetros e Opções de Seleção                          *
*----------------------------------------------------------------------*
selection-screen begin of block b0 with frame title text-s00.
parameters: p_bukrs    like bseg-bukrs obligatory,
            p_gsber    like bseg-gsber obligatory,
            p_hkont    like bseg-hkont obligatory.
selection-screen end of block b0.
*----------------------------------------------------------------------*
* At Selection-Screen                                                  *
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* Variáveis Globais                                                    *
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* Field Symbols                                                        *
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* Definição de Range                                                   *
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* Ponteiro de Objeto                                                   *
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* Classes Locais                                                       *
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* Containers                                                           *
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* Initialization                                                       *
*----------------------------------------------------------------------*
initialization.

*----------------------------------------------------------------------*
* Definição Macros                                                     *
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* Start-Of-Selection                                                   *
*----------------------------------------------------------------------*
start-of-selection.

  perform f_seleciona_dados.

  perform f_atualisa_dados.

end-of-selection.

*----------------------------------------------------------------------*
* Top-of-page                                                          *
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* End-of-page                                                          *
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* At User-command                                                      *
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* At Line-selection                                                    *
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* Início das Sub-Rotinas                                               *
*----------------------------------------------------------------------*


*&---------------------------------------------------------------------*
*&      Form  f_seleciona_dados
*&---------------------------------------------------------------------*
*       Seleciona dados na BSIK apartir dos parametros informados.
*----------------------------------------------------------------------*
form f_seleciona_dados .

  clear it_bsik[].

  select bukrs hkont gsber bschl belnr xblnr zuonr
    from bsik
    into table it_bsik
   where bukrs eq p_bukrs
     and hkont eq p_hkont
     and gsber eq p_gsber
     and ( ( bschl eq '21' ) or ( bschl eq '31') ).

endform.                    " f_seleciona_dados
*&---------------------------------------------------------------------*
*&      Form  f_atualisa_dados
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
form f_atualisa_dados .
  data: vl_cnt           type n,
        vl_msg           type c length 50.

  clear wa_bsik.

  loop at it_bsik into wa_bsik.

    check not wa_bsik-xblnr is initial.

    update bsik set zuonr =  wa_bsik-xblnr
              where bukrs eq wa_bsik-bukrs
                and hkont eq wa_bsik-hkont
                and gsber eq wa_bsik-gsber
                and belnr eq wa_bsik-belnr.

    update bseg set zuonr =  wa_bsik-xblnr
              where bukrs eq wa_bsik-bukrs
                and hkont eq wa_bsik-hkont
                and gsber eq wa_bsik-gsber
                and belnr eq wa_bsik-belnr.

    vl_cnt = vl_cnt + 1.

  endloop.

  concatenate 'Foram atualizados'
              vl_cnt
              'registros.' into vl_msg
              separated by space.

  message i000 with  vl_msg .

endform.                    " f_atualisa_dados
