*  &--------------------------------------------------------------------&*
*  &                        ROLLOUT - Consultoria                       &*
*  &--------------------------------------------------------------------&*
*  & Projeto..: AMaggi                                                  &*
*  & Autor....: Igor Sobral                                             &*
*  & Data.....: 25/06/2013                                              &*
*  & Descrição: Lançamento Manuais                                      &*
*  & Transação: ZGL014                                                  &*
*  &--------------------------------------------------------------------&*
*  & Projeto  :                                                         &*
*  & Código Espec.Funcional/Técnica:                                    &*
*  &--------------------------------------------------------------------&*
*  &                    Histórico de Modificações                       &*
*  & Autor           Request      Data         Descrição                &*
*  &                                                                    &*
*  &--------------------------------------------------------------------&*

*&---------------------------------------------------------------------*
*& PoolMóds.         ZGL013
*&---------------------------------------------------------------------*

INCLUDE ZGL013_TOP.  " GLOBAL Data

INCLUDE ZGL013_O01.  " PBO-Modules
INCLUDE ZGL013_I01.  " PAI-Modules
INCLUDE ZGL013_F01.  " FORM-Routines
