*&--------------------------------------------------------------------&*
*&                        ROLLOUT - Consultoria                       &*
*&--------------------------------------------------------------------&*
*& Projeto..: AMaggi                                                  &*
*& Autor....: Igor Sobral                                             &*
*& Data.....: 05/07/2013                                              &*
*& Descrição: Lançamento Manuais -                                    &*
*& Transação: ZGL015                                                  &*
*&--------------------------------------------------------------------&*
*& Projeto  :                                                         &*
*& Código Espec.Funcional/Técnica:                                    &*
*&--------------------------------------------------------------------&*
*&                    Histórico de Modificações                       &*
*& Autor           Request      Data         Descrição                &*
*&                                                                    &*
*&--------------------------------------------------------------------&*

*&---------------------------------------------------------------------*
*& PoolMóds.         ZGL015
*&---------------------------------------------------------------------*

INCLUDE ZGL015_TOP.   " global Data

INCLUDE ZGL015_O01.   " PBO-Modules
INCLUDE ZGL015_I01.   " PAI-Modules
INCLUDE ZGL015_F01.   " FORM-Routines
