*&--------------------------------------------------------------------&*
*&                        ROLLOUT - Consultoria                       &*
*&--------------------------------------------------------------------&*
*& Projeto..: AMaggi                                                  &*
*& Autor....: Igor Sobral                                             &*
*& Data.....: 02/07/2013                                              &*
*& Descrição: Lançamento Manuais - Lotes                              &*
*& Transação: ZGL014                                                  &*
*&--------------------------------------------------------------------&*
*& Projeto  :                                                         &*
*& Código Espec.Funcional/Técnica:                                    &*
*&--------------------------------------------------------------------&*
*&                    Histórico de Modificações                       &*
*& Autor           Request      Data         Descrição                &*
*&                                                                    &*
*&--------------------------------------------------------------------&*

*&---------------------------------------------------------------------*
*& PoolMóds.         ZGL014
*&---------------------------------------------------------------------*

INCLUDE ZGL014_TOP.   " GLOBAL Data

INCLUDE ZGL014_O01.   " PBO-Modules
INCLUDE ZGL014_I01.   " PAI-Modules
INCLUDE ZGL014_F01.   " FORM-Routines
